InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоИнвойсам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоИнвойсам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте инвойса закупки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>валюта инвойса закупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсовПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсовПродажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойсаПродажи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемИзменено</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтмененЗакачиком</Name>
					<Comment>API</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
					<Comment>API</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Comment>API</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИнвойсПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацииИнвойс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацииИнвойс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скидка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Долги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗакрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неоплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИнвойсЗакупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНаСкладеОтправителя</Name>
					<Comment>Дата на складе отправителя</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнспекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоИнспектировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авианакладная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатыВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетдыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеИнвойса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Треки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Трек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/РаботаСИнвойсами/Ext/Module.bsl
#Область Инвойсы

//Функция СуммаКоличествоИнвойсаСУчетомКорректировок(СсылкаИнвойс) Экспорт
//	
//	Результат = Новый Структура("Количество,Сумма", 0, 0);

//	Если СсылкаИнвойс.Проведен Тогда
//		
//		ЗапрКор = Новый Запрос;
//		ЗапрКор.Текст = "ВЫБРАТЬ
//		                |	СУММА(ОтправкаИнвойсовОбороты.КоличествоОборот) КАК Количество,
//		                |	СУММА(ОтправкаИнвойсовОбороты.СуммаОборот) КАК Сумма,
//		                |	ОтправкаИнвойсовОбороты.Инвойс
//		                |ИЗ
//		                |	РегистрНакопления.ОтправкаИнвойсов.Обороты КАК ОтправкаИнвойсовОбороты
//		                |ГДЕ
//		                |	ОтправкаИнвойсовОбороты.Инвойс = &Инвойс
//		                |
//		                |СГРУППИРОВАТЬ ПО
//		                |	ОтправкаИнвойсовОбороты.Инвойс"; 
//		ЗапрКор.УстановитьПараметр("Инвойс", СсылкаИнвойс);
//		Выборка = ЗапрКор.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда
//			Результат.Вставить("Количество", Выборка.Количество);
//			Результат.Вставить("Сумма", Выборка.Сумма);
//		КонецЕсли;	
//	
//	ИначеЕсли НЕ СсылкаИнвойс.ПометкаУдаления Тогда
//	
//		Результат.Вставить("Количество", СсылкаИнвойс.ВКД_Товары.Итог("Количество"));
//		Результат.Вставить("Сумма", СсылкаИнвойс.ВКД_Товары.Итог("СуммаЗакупки"));
//	
//	КонецЕсли;
//	
//	Возврат Результат;

//КонецФункции 
	
Функция ИнвойсПоИнвойсуЗакупки(СсылкаИнвойсЗакупки)

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ДокументОснование", СсылкаИнвойсЗакупки);
	Запр.Текст = "ВЫБРАТЬ
	             |	_Инвойс.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ._Инвойс КАК _Инвойс
	             |ГДЕ
	             |	_Инвойс.ДокументОснование = &ДокументОснование
	             |	И _Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Товар)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	_Инвойс.ПометкаУдаления";
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	Иначе	
	    Возврат Документы._Инвойс.ПустаяСсылка();
	КонецЕсли;

КонецФункции // ИнвойсПоИнвойсуЗакупки()

Функция ИнвойсыИерархии(СсылкаИнвойс)
	
	ИнвойсыИерархии = Новый Массив;
	
	Если ТипЗнч(СсылкаИнвойс) = Тип("ДокументСсылка._Инвойс") Тогда
		Если ЗначениеЗаполнено(СсылкаИнвойс.ДокументОснование) Тогда
			ДокументОснование = СсылкаИнвойс.ДокументОснование;	
		Иначе	
	        ДокументОснование = Неопределено;
			ИнвойсыИерархии.Добавить(СсылкаИнвойс);
		КонецЕсли;
	Иначе
		ДокументОснование = СсылкаИнвойс;	
	КонецЕсли;	
	
	ЕстьУдаленные = Ложь;
	Если ДокументОснование <> Неопределено Тогда  
		ИнвойсыИерархии.Добавить(ДокументОснование);
		Запр = Новый Запрос; 
		Запр.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запр.Текст = "ВЫБРАТЬ
		             |	Инвойс.Ссылка,
		             |	Инвойс.ПометкаУдаления
		             |ИЗ
		             |	Документ._Инвойс КАК Инвойс
		             |ГДЕ
		             |	Инвойс.ДокументОснование = &ДокументОснование";
        Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.ПометкаУдаления Тогда
				ЕстьУдаленные = Истина;
			Иначе
				ИнвойсыИерархии.Добавить(Выборка.Ссылка);	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат Новый Структура("Инвойсы,ЕстьУдаленные", ИнвойсыИерархии, ЕстьУдаленные);
	
КонецФункции	

// Обработчик записи в РС СостоянияИнвойсов
//
// Параметры:
//	СсылкаИнвойс 	- ДокументСсылка._Инвойс, ДокументСсылка.ИнвойсЗакупки - документ, статус(ы) к-рого регистрируются
//	Статус 			- ПеречислениеСсылка.СтатусыИнвойса - (Необязательный)
//  СтатусИнспекции - ПеречислениеСсылка.СтатусыИнспекции - (Необязательный)  
//  СтатусОплаты    - ПеречислениеСсылка.СтатусыОплаты - (Необязательный) - статус оплаты, устанавливаемый вручную
//  СтатусОплатыАвто- ПеречислениеСсылка.Долги - (Необязательный) - статус оплаты, определенный автоматически
//  СуммаОплаты     - Число - (Необязательный) - общая сумма оплат
//  ДатаОплаты      - Дата - (Необязательный) - дата последней оплаты
//  Курс            - Число - (Необязательный) - средний курс оплат
//  ВызовИз			- ДокументСсылка, Строка - (Необязательный) - только для записи в журнал регистрации
//
Процедура ЗаписатьСтатусыИнвойса(СсылкаИнвойс, Статус = Неопределено, СтатусИнспекции = Неопределено, СтатусОплаты = Неопределено, 
								СтатусОплатыАвто = Неопределено, СуммаОплаты = Неопределено, ДатаОплаты = Неопределено, Курс = Неопределено,
								ВызовИз = Неопределено) Экспорт

	ИнвойсыИерархии = ИнвойсыИерархии(СсылкаИнвойс);
	
	Для Каждого Инвойс ИЗ ИнвойсыИерархии.Инвойсы Цикл 
		
		Если Не ЗначениеЗаполнено(Инвойс) Тогда
			Продолжить;
		КонецЕсли;     
		
		МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Инвойс = Инвойс;
        МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Инвойс = Инвойс;
		
		лСтатус = "";
		Если Статус <> Неопределено Тогда
			МенеджерЗаписи.Статус			= Статус;   
			лСтатус = лСтатус + "инвойс -> " + ?(МенеджерЗаписи.Статус=Перечисления.СтатусыИнвойса.ПустаяСсылка(), "пусто", МенеджерЗаписи.Статус) + ", ";
		КонецЕсли;
		Если СтатусИнспекции <> Неопределено Тогда
			МенеджерЗаписи.СтатусИнспекции	= СтатусИнспекции;   
			лСтатус = лСтатус + "инспекция -> " + МенеджерЗаписи.СтатусИнспекции + ", ";
		КонецЕсли;
		Если СтатусОплаты <> Неопределено Тогда
			МенеджерЗаписи.СтатусОплаты		= СтатусОплаты;   
			лСтатус = лСтатус + "оплата -> " + МенеджерЗаписи.СтатусОплаты + ", ";
		КонецЕсли;
		Если СтатусОплатыАвто <> Неопределено Тогда
			МенеджерЗаписи.СтатусОплатыАвто	= СтатусОплатыАвто;   
			лСтатус = лСтатус + "оплата инвойсов -> " + МенеджерЗаписи.СтатусОплатыАвто + ", ";
		КонецЕсли; 
		Если СуммаОплаты <> Неопределено Тогда
			МенеджерЗаписи.СуммаОплаты = СуммаОплаты;
			лСтатус = лСтатус + "сумма -> " + МенеджерЗаписи.СуммаОплаты + ", ";
		КонецЕсли;
		Если ДатаОплаты <> Неопределено Тогда
			МенеджерЗаписи.ДатаОплаты = ДатаОплаты;
		КонецЕсли;
		Если Курс <> Неопределено Тогда
			МенеджерЗаписи.Курс = Курс;
		КонецЕсли;
		МенеджерЗаписи.Записать();
		
		Если лСтатус = "" Тогда
			лСтатус = "не изменены";
		Иначе	
			лСтатус = Лев(лСтатус, СтрДлина(лСтатус)-2);
		КонецЕсли; 	
		Если ЗначениеЗаполнено(ВызовИз) Тогда
			лСтатус = лСтатус + " (вызов " + ВызовИз + ")"; 
		КонецЕсли;
		ЗаписьЖурналаРегистрации("Инвойс.Запись статуса инвойса", УровеньЖурналаРегистрации.Информация, Инвойс.Метаданные(), Инвойс, "Статусы: " + лСтатус);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура определяет и записывает в РС СостоянияИнвойсов данные в ресурс Расхождения
//
// Параметры:
//  СсылкаИнвойс - ДокументСсылка._Инвойс, ДокументСсылка.ИнвойсЗакупки
//
Процедура ЗаписатьРасхожденияИнвойса(СсылкаИнвойс) Экспорт
	
	ИнвойсыИерархии = ИнвойсыИерархии(СсылкаИнвойс);
	
	Если ИнвойсыИерархии.Инвойсы.ВГраница() < 1 Тогда 
		// для одного док-та не существует расхождений  
		МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Инвойс 		= СсылкаИнвойс;
		МенеджерЗаписи.Прочитать(); 
		МенеджерЗаписи.Инвойс 		= СсылкаИнвойс;  
		МенеджерЗаписи.Расхождения 	= Ложь; 
		МенеджерЗаписи.Состояние	= 3;
		МенеджерЗаписи.Записать();
		гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> нет расхождений, нет связанных инвойсов", СсылкаИнвойс.Метаданные().Синоним, "Запись состояния инвойса", СсылкаИнвойс, 4);
		Возврат;	
	Иначе	
		
		Состояние = 3;  //0 - проведен, 1 - не проведен, 2 - пом.удален, 3 - нет док-та
		ЕстьПроведенные 	= Ложь;
		ЕстьНЕПроведенные 	= Ложь;
		ЕстьПомеченныеНаУд	= ИнвойсыИерархии.ЕстьУдаленные;
		Для Каждого Инвойс ИЗ ИнвойсыИерархии.Инвойсы Цикл
			Если ТипЗнч(Инвойс) = Тип("ДокументСсылка._Инвойс") Тогда
				Если Инвойс.Проведен Тогда
					ЕстьПроведенные = Истина;
				Иначе
					ЕстьНЕПроведенные = Ложь;
				КонецЕсли;    
			КонецЕсли;
		КонецЦикла;
		Если ЕстьПомеченныеНаУд И НЕ ЕстьПроведенные И НЕ ЕстьНЕПроведенные Тогда
			Состояние = 2;	
		ИначеЕсли ЕстьНЕПроведенные Тогда
			Состояние = 1;
		ИначеЕсли ЕстьПроведенные И НЕ ЕстьНЕПроведенные Тогда
			Состояние = 0;
		КонецЕсли;
		
		Если ТипЗнч(СсылкаИнвойс) = Тип("ДокументСсылка._Инвойс") Тогда	
			ИнвойсЗакупки  	= СсылкаИнвойс.ДокументОснование;
		Иначе           
			ИнвойсЗакупки	= СсылкаИнвойс;
		КонецЕсли;
		
		Запр = Новый Запрос;   
		Запр.УстановитьПараметр("ИнвойсЗакупки", ИнвойсЗакупки);
		Запр.Текст = "ВЫБРАТЬ
		             |	Инвойс.Ссылка КАК Инвойс,
		             |	СУММА(ВЫБОР
		             |			КОГДА Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Скидка)
		             |				ТОГДА Инвойс.СуммаВВалютеИнвойса
		             |			ИНАЧЕ Инвойс.Сумма
		             |		КОНЕЦ) * Инвойс.Курс КАК СуммаПересчет,
		             |	СУММА(ВЫБОР
		             |			КОГДА Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.Товар)
		             |					ИЛИ Инвойс.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацииИнвойс.ПустаяСсылка)
		             |				ТОГДА Инвойс.ВКД_Количество
		             |			ИНАЧЕ 0
		             |		КОНЕЦ) КАК Количество
		             |ПОМЕСТИТЬ ВсеИнвойсы
		             |ИЗ
		             |	Документ._Инвойс КАК Инвойс
		             |ГДЕ
		             |	Инвойс.ДокументОснование = &ИнвойсЗакупки
		             |	И НЕ Инвойс.ПометкаУдаления
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	Инвойс.Ссылка,
		             |	Инвойс.Курс
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	_Инвойс.Контрагент <> ИнвойсЗакупки.Контрагент КАК РазнКонтрагент,
		             |	_Инвойс.ВКД_НомерИнвойсаПоставщика <> ИнвойсЗакупки.НомерИнвойсаПоставщика КАК РазнНомерИнвойсаПоставщика,
		             |	_Инвойс.ВКД_ДатаИнвойсаПоставщика <> ИнвойсЗакупки.ДатаИнвойсаПоставщика КАК РазнДатаИнвойсаПоставщика,
		             |	ВсеИнвойсы.СуммаПересчет КАК Сумма,
		             |	ВсеИнвойсы.Количество КАК Количество
		             |ИЗ
		             |	Документ._Инвойс КАК _Инвойс
		             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвойсЗакупки КАК ИнвойсЗакупки
		             |		ПО _Инвойс.ДокументОснование = ИнвойсЗакупки.Ссылка
		             |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеИнвойсы КАК ВсеИнвойсы
		             |		ПО (ВсеИнвойсы.Инвойс = _Инвойс.Ссылка)
		             |ГДЕ
		             |	_Инвойс.ДокументОснование = &ИнвойсЗакупки";  
		РезультатЗапроса = Запр.Выполнить(); 
		Выгрузка = РезультатЗапроса.Выгрузить();
		Выборка = РезультатЗапроса.Выбрать(); 
		Если Выборка.Следующий() Тогда  
			
			Для Каждого Инвойс ИЗ ИнвойсыИерархии.Инвойсы Цикл 
				
				РазнКоличество = Выгрузка.Итог("Количество") <> ИнвойсЗакупки.Количество;
				РазнСумма = Выгрузка.Итог("Сумма") - ИнвойсЗакупки.Сумма;
				Если РазнСумма < 0 Тогда
					РазнСумма = - РазнСумма;
				КонецЕсли;
				РазнСумма = РазнСумма > 0.9; 
				
				// добавление записи в РС
				МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Инвойс 		= Инвойс;
				МенеджерЗаписи.Прочитать();    
				МенеджерЗаписи.Инвойс 		= Инвойс;
				МенеджерЗаписи.Расхождения  = Выборка.РазнКонтрагент ИЛИ 
												Выборка.РазнНомерИнвойсаПоставщика ИЛИ
												Выборка.РазнДатаИнвойсаПоставщика ИЛИ
												РазнКоличество ИЛИ
												РазнСумма;
				МенеджерЗаписи.Состояние 	= Состояние;											
				МенеджерЗаписи.Записать(); 
			
				// Запишем лог в ЖР
				Если МенеджерЗаписи.Расхождения Тогда
					ИнфоЖР = "Да: ";
					Если Выборка.РазнКонтрагент Тогда
						ИнфоЖР = ИнфоЖР + "контрагент, "; 
					КонецЕсли;
					Если РазнСумма Тогда
						ИнфоЖР = ИнфоЖР + "сумма, "; 
					КонецЕсли;
					Если РазнКоличество Тогда
						ИнфоЖР = ИнфоЖР + "кол-во, "; 
					КонецЕсли;
					Если Выборка.РазнНомерИнвойсаПоставщика Тогда
						ИнфоЖР = ИнфоЖР + "№ инв.поставщика, "; 
					КонецЕсли;
					Если Выборка.РазнДатаИнвойсаПоставщика Тогда
						ИнфоЖР = ИнфоЖР + "дата инв.поставщика, "; 
					КонецЕсли;
				    ИнфоЖР = Лев(ИнфоЖР, СтрДлина(ИнфоЖР)-2);
				Иначе
					ИнфоЖР = "Нет"; 
				КонецЕсли;
				гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> " + ИнфоЖР, Инвойс.Метаданные().Синоним, "Запись состояния инвойса", Инвойс, 4);
				
			КонецЦикла;	
		
		Иначе
			
			// добавление записи в РС
			МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Инвойс 		= СсылкаИнвойс;
			МенеджерЗаписи.Расхождения = Ложь;
			МенеджерЗаписи.Записать(); 
			гоЗаписьЖурналаРегистрации("Расхождения (инв.закупки и товарный инвойс) -> создание документа", СсылкаИнвойс.Метаданные().Синоним, "Запись состояния инвойса", Инвойс, 4);
			 
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

// Возвращает: последнюю дату оплаты, общую сумму оплат, средний курс оплат, СтатусОплатыАвто 
//             (полагаем что в регистре обеспечена единая валюта для каждого инвойса - валюта ИнвойсаЗакупки)
//
// Параметры:
//  СсылкаИнвойс 			- ДокументСсылка._Инвойс - инвойс расчетов
//  СсылкаДокументВызова 	- ДокументСсылка._Инвойс, ДокументСсылка.ДвижениеДенег - документ, из к-рого производится запись
//  УчестьДокументВызова 	- Булево - при проведении ДвиженияДенег устанавливать Истина, в остальных случаях - Ложь
//
Функция СостояниеОплатыИнвойса(СсылкаИнвойс, СсылкаДокументВызова, УчестьДокументВызова) Экспорт
	
	ВалютаИнвойса 	= ?(ЗначениеЗаполнено(СсылкаИнвойс.ДокументОснование), СсылкаИнвойс.ДокументОснование.Валюта, СсылкаИнвойс.Валюта);
	ДатаОплаты 		= Дата(1,1,1); 
	Сумма 			= 0; 
	СуммаОплаты		= 0; // для расчета ср.курса оплат
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Инвойс", 		СсылкаИнвойс);
	Запр.УстановитьПараметр("Регистратор", 	СсылкаДокументВызова);
	Запр.Текст = "ВЫБРАТЬ
	             |	РасчетыПоИнвойсам.Сумма КАК Сумма,
	             |	РасчетыПоИнвойсам.СуммаОплаты КАК СуммаОплаты,
	             |	РасчетыПоИнвойсам.Период КАК Период
	             |ИЗ
	             |	РегистрНакопления.РасчетыПоИнвойсам КАК РасчетыПоИнвойсам
	             |ГДЕ
	             |	РасчетыПоИнвойсам.Инвойс = &Инвойс
	             |	И РасчетыПоИнвойсам.Регистратор <> &Регистратор";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если ТипЗнч(СсылкаДокументВызова) <> Тип("ДокументСсылка._Инвойс") Тогда
			ДатаОплаты = макс(ДатаОплаты, Выборка.Период); 
		КонецЕсли;
		Сумма = Сумма + Выборка.Сумма;
		СуммаОплаты = СуммаОплаты + Выборка.СуммаОплаты;
	КонецЦикла; 
	
	Если УчестьДокументВызова И ТипЗнч(СсылкаДокументВызова) = Тип("ДокументСсылка.ДвижениеДенег") Тогда
		Запр.Текст = "ВЫБРАТЬ
		             |	ДвижениеДенегИнвойсы.Сумма КАК Сумма,
		             |	ДвижениеДенегИнвойсы.СуммаОплаты КАК СуммаОплаты,
		             |	ДвижениеДенегИнвойсы.Ссылка.Фирма КАК Фирма,
		             |	ДвижениеДенегИнвойсы.Ссылка.Валюта КАК Валюта,
		             |	ДвижениеДенегИнвойсы.Ссылка.Дата КАК Дата
		             |ИЗ
		             |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
		             |ГДЕ
		             |	ДвижениеДенегИнвойсы.Ссылка = &Регистратор
		             |	И ДвижениеДенегИнвойсы.Инвойс = &Инвойс";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДатаОплаты = макс(ДатаОплаты, Выборка.Дата); 
			Сумма = Сумма + Выборка.Сумма;
			СуммаОплаты = СуммаОплаты + Выборка.СуммаОплаты;
		КонецЦикла;
	КонецЕсли;
	
	Если Сумма = 0 Тогда
		Статус = Перечисления.Долги.Неоплачено;
	ИначеЕсли Сумма < СсылкаИнвойс.Сумма Тогда	
		Статус = Перечисления.Долги.Частично;	
	Иначе
	    Статус = Перечисления.Долги.Полностью;
	КонецЕсли; 
	
	Возврат Новый Структура("ДатаОплаты, СуммаОплаты, Курс, СтатусОплатыАвто", 
							ДатаОплаты, 
							Сумма,
							?(СсылкаИнвойс.Валюта.ОбратныйКурс, ?(Сумма=0,0,СуммаОплаты/Сумма), ?(СуммаОплаты=0,0,Сумма/СуммаОплаты)),
							Статус);
	
КонецФункции 

Функция ВалютаИнвойса(ИнвойсСсылка) Экспорт
	
	ДокументОснование = ИнвойсСсылка.ДокументОснование;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат ДокументОснование.Валюта;
	Иначе
		Возврат ИнвойсСсылка.Валюта;		
	КонецЕсли;	

КонецФункции 

Функция СостояниеДолга(СуммаОплат, ОбщаяСумма) Экспорт
	
	Если ОбщаяСумма = 0 Тогда
		Возврат Перечисления.Долги.ПустаяСсылка();
	ИначеЕсли СуммаОплат >= ОбщаяСумма Тогда
		Возврат Перечисления.Долги.Полностью;
	ИначеЕсли СуммаОплат = 0 Тогда
		Возврат Перечисления.Долги.Неоплачено;
	Иначе
		Возврат Перечисления.Долги.Частично;
	КонецЕсли;
	
КонецФункции // СостояниеОплаты()

#КонецОбласти 


#Область ИнвойсыПродажи

// Запись в РС СостоянияИнвойсовПродажи.
// Если новый статус тот же и параметры АПИ не заданы, запись не выполняется.
//
// Параметры:
//  СсылкаИнвойсПродажи - ДокументСсылка.ИнвойсПродажи - документ, статус которого регистрируется;
//  Статус              - ПеречислениеСсылка.СтатусыИнвойсаПродажи - (Необязательный) - новый статус;
//                        если не заполнен, ресурс Состояние не изменяется;
//  Инициатор           - ДокументСсылка - документ, вызвавший изменение статуса;
//  КемИзменено         - СправочникСсылка.Сотрудники - (Необязательный);
//  ОтмененАПИ          - Булево, Неопределено - дата отмены заказчиком (ресурс ОтмененЗакачиком);
//                        Неопределено — ресурс не изменяется;
//  ОтгруженАПИ         - Булево, Неопределено - дата отгрузки через API (ресурс Отгружен);
//                        Неопределено — ресурс не изменяется;
//  ЗаблокированАПИ     - Булево, Неопределено - заблокирован через API (ресурс Заблокирован);
//                        Неопределено — ресурс не изменяется;
//  Отказ               - Булево - (Необязательный) - Истина при ошибке записи статуса.
//
Процедура ЗаписатьСтатусИнвойсаПродажи(СсылкаИнвойсПродажи, Статус, Инициатор = Неопределено, КемИзменено = Неопределено,
										ОтмененАПИ = Неопределено, ГотовКОтгрузкеАПИ = Неопределено, ЗаблокированАПИ = Неопределено, Отказ = Ложь) Экспорт
	
	Попытка
		
		ПустаяДата = Дата(1,1,1);
		Сейчас = ТекущаяДатаСеанса();
		
		МенеджерЗаписи = РегистрыСведений.СостоянияИнвойсовПродажи.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ИнвойсПродажи = СсылкаИнвойсПродажи;
		МенеджерЗаписи.Прочитать();
		
		ЕстьИзменениеСтатуса = ЗначениеЗаполнено(Статус)
			И (НЕ ЗначениеЗаполнено(МенеджерЗаписи.Состояние) ИЛИ МенеджерЗаписи.Состояние <> Статус);
		ЕстьИзменениеАПИ = ОтмененАПИ <> Неопределено ИЛИ ГотовКОтгрузкеАПИ <> Неопределено ИЛИ ЗаблокированАПИ <> Неопределено;
		
		Если НЕ ЕстьИзменениеСтатуса И НЕ ЕстьИзменениеАПИ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЕстьИзменениеСтатуса Тогда
			МенеджерЗаписи.Состояние = Статус;
			Если Инициатор = Неопределено Тогда
				МенеджерЗаписи.Инициатор = гоПользователь();  
			Иначе
				МенеджерЗаписи.Инициатор = Инициатор;  
			КонецЕсли;
		КонецЕсли;
		
		Если (ЕстьИзменениеСтатуса ИЛИ ЕстьИзменениеАПИ) И ЗначениеЗаполнено(КемИзменено) Тогда
			МенеджерЗаписи.КемИзменено = КемИзменено;
		КонецЕсли;
		
		Если ОтмененАПИ <> Неопределено Тогда
			МенеджерЗаписи.ОтмененЗакачиком = ?(ОтмененАПИ, Сейчас, ПустаяДата);
		КонецЕсли;
		Если ГотовКОтгрузкеАПИ <> Неопределено Тогда
			МенеджерЗаписи.ГотовКОтгрузке = ?(ГотовКОтгрузкеАПИ, Сейчас, ПустаяДата);
		КонецЕсли;
		Если ЗаблокированАПИ <> Неопределено Тогда
			МенеджерЗаписи.Заблокирован = ?(ЗаблокированАПИ, Сейчас, ПустаяДата);
		КонецЕсли;
		
		МенеджерЗаписи.ИнвойсПродажи = СсылкаИнвойсПродажи;
		МенеджерЗаписи.Зарегистрировано = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать();
		
		ТекстСобытия = "Статус: " + Статус;
		Если ОтмененАПИ <> Неопределено Тогда
			ТекстСобытия = ТекстСобытия + ", отменен API: " + ОтмененАПИ;
		КонецЕсли;
		Если ГотовКОтгрузкеАПИ <> Неопределено Тогда
			ТекстСобытия = ТекстСобытия + ", готов к отгрузке API: " + ГотовКОтгрузкеАПИ;
		КонецЕсли;
		Если ЗаблокированАПИ <> Неопределено Тогда
			ТекстСобытия = ТекстСобытия + ", заблокирован API: " + ЗаблокированАПИ;
		КонецЕсли;
		ЗаписьЖурналаРегистрации("ИнвойсПродажи.Запись статуса", УровеньЖурналаРегистрации.Информация, СсылкаИнвойсПродажи.Метаданные(), СсылкаИнвойсПродажи, ТекстСобытия);
		
	Исключение

		ЗаписьЖурналаРегистрации("ИнвойсПродажи.Ошибка записи статуса", УровеньЖурналаРегистрации.Ошибка, СсылкаИнвойсПродажи.Метаданные(), СсылкаИнвойсПродажи, ОписаниеОшибки());
		Отказ = Истина;

	КонецПопытки;
	
КонецПроцедуры  

// Возвращает статус (структурой или строкой)
//
Функция ПолучитьСтатусИнвойсаПродажи(СсылкаИнвойсПродажи, КраткоСтрокой = Ложь) Экспорт

	Результат = Новый Структура("Состояние,Инициатор,Зарегистрировано,КемИзменено,ОтмененЗакачиком,ГотовКОтгрузке,Заблокирован");
	Если НЕ ЗначениеЗаполнено(СсылкаИнвойсПродажи) Тогда
		Возврат Результат;
	КонецЕсли;
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", СсылкаИнвойсПродажи);
	Запр.Текст = "ВЫБРАТЬ
	             |	Состояния.Состояние КАК Состояние,
	             |	Состояния.Инициатор КАК Инициатор,
	             |	Состояния.Зарегистрировано КАК Зарегистрировано,
	             |	Состояния.КемИзменено КАК КемИзменено,
	             |	Состояния.ОтмененЗакачиком КАК ОтмененЗакачиком,
	             |	Состояния.ГотовКОтгрузке КАК ГотовКОтгрузке,
	             |	Состояния.Заблокирован КАК Заблокирован
	             |ИЗ
	             |	РегистрСведений.СостоянияИнвойсовПродажи КАК Состояния
	             |ГДЕ
	             |	Состояния.ИнвойсПродажи = &Ссылка";
	РезультатЗапроса = Запр.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
        Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);	
	КонецЕсли; 
	Если КраткоСтрокой Тогда
		РезультатАПИ = "";
		Если Выборка.ОтмененЗаказчиком <> Дата(1,1,1) Тогда 
			РезультатАПИ = "отменен"
		КонецЕсли;
		Если Выборка.ГотовКОтгрузке <> Дата(1,1,1) Тогда 
			РезультатАПИ = ?(РезультатАПИ = "", "", ", ") + "готов к отгрузке"
		КонецЕсли; 
		Если Выборка.Заблокирован <> Дата(1,1,1) Тогда 
			РезультатАПИ = ?(РезультатАПИ = "", "", ", ") + "заблокирован"
		КонецЕсли; 
		Результат = Строка(Выборка.Состояние) + ?(РезультатАПИ="", "", ", API: " +РезультатАПИ); 
	КонецЕсли;
	Возврат Результат;

КонецФункции 

#КонецОбласти
